Tekla Open API Reference for Tekla Structures 2025
Chamfer.DZ1 Property
 The thickness above the offset.
Note that this does nothing when used with the PolyBeam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double DZ1 { get; set; }
Public Property DZ1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Chamfer Class
Tekla.Structures.Model Namespace